<?php
header("Content-type: text/html; charset=utf-8");

/*
	PHP中的运算符类型:
		1、算术运算符
		2、递增/递减运算符
		3、比较运算符
		4、逻辑运算符
		5、位运算符
		6、其他运算符
*/

/*
//1、算术运算符

	$a = 100;
	$b = 200;
	$c = $a + $b;
	$d = $c - 300;
	$e = $c*2;
	$f = $e/3;
	$g = 5%3;
	echo '$c = '.$c.'<br/>$d = '.$d.'<br/>$e = '.$e.'<br/>$f = '.$f.'<br/>5除以3的余数:'.$g;
*/

/*
	//2、递增/递减运算符
		$a = $a + 1;
		$a+=1;
		$a++;
		++$a;
		$a--;
		--$a;
		
		$a = 1;
		$c = 10 + $a++;
		echo "<h1>\$a=".$a."</h1>";
		echo "<h1>\$c=".$c."</h1>";
		
		echo "<hr/>";
		
		$a = 1;
		$c = 10 + ++$a;
		echo "<h1>\$a=".$a."</h1>";
		echo "<h1>\$c=".$c."</h1>";
*/

/*
	3、比较运算符
		> 大于
		< 小于
		>= 		大于等于
		<= 		小于等于
		<> != 	不等于
		!== 	不全等于
		== 		等于
		=== 	全等于
		
	$a = 1;
	$pass = '123456';
	var_dump($a>3);
	
	转到08_1.php
*/

$a = 2;
$b = '2';

var_dump($b !== $a);

























?>